org/JavaScript简明总结.org
#+SETUPFILE: ../theme-rose.setup
#+DATE: <2020-11-15 日>
#+TITLE: JavaScript简明总结

* 前言
  JavaScript发展至今已经是一门全栈语言了，你可以用它进行桌面应用开发，移动开发，服务端开发，前端开发等。
* 运行
** 运行方式
   JavaScript和CSS一样可以有三种被引用的方式，第一种，引用外部js文件。

   #+begin_src html
     <script src="path_to/file.js" type="text/javascript"/>
   #+end_src

   第二种，直接将代码放在HTML文件中。

   #+begin_src html
     <html>
       <head>
         <script type="text/javascript">
           alert('Hello World')
         </script>
       </head>
       <body>
       </body>
     </html>
   #+end_src

   第三种，将代码放在标签的动作属性上。
  
   #+begin_src html
     <html>
       <head>
       </head>
       <body>
         <em onclick="alert('Hello World')">点我</em>
       </body>
     </html>
   #+end_src
** 调试
   调试JS代码通常由浏览器的前端调试工具提供，打开调试工具的快捷键通常是 ~F12~ 。
   #+begin_src html
     <html>
         <head>
             <script type="text/javascript">
              /* 输出内容至控制台 */
              console.log("Hello World")
             </script>
         </head>
         <body>
             <p>打开这个页面会在控制台输出Hello World</p>
         </body>
     </html>
   #+end_src
** 注释
   JS代码的注释有:
   #+begin_src js
     // 单行注释
     /*
       多行注释
       多行注释
      */

   #+end_src
** 分号
   JS代码结尾可以不加分号，关于是否需要写上可以根据你所在的团队和个人习惯决定。
* 数据类型
  JS具有一些内置的数据类型，分别是如下几种。
** 数值型
   数值型分为四类- ~整数~ ， ~浮点数~  ， ~NaN~ 和 ~Infinity~ 。
*** 整数
    #+begin_src javascript
      console.log(1)
      console.log(-1)
    #+end_src
*** 浮点数
    #+begin_src javascript
      console.log(1.0)
      console.log(-1.1111)
    #+end_src
*** NaN
    代表非数字
    #+begin_src javascript
      console.log(0 / 0) // Nan
      Number('a')        // Nan

      // 判断对象是否是NaN
      console.log(isNaN(NaN))         // => true
      console.log(isNaN('a'))         // => true
      console.log(isNaN(1))           // false

      // 坑，想要判断一个NaN对象，使用isNaN
      console.log(NaN != NaN)
    #+end_src
*** Infinity
    代表无穷大或小的数字
    #+begin_src javascript
      console.log(1 / 0)
    #+end_src
*** typeof
    检查类型
    #+begin_src javascript
      console.log(typeof 1)        // => number
      console.log(typeof 1.0)      // => number
      console.log(typeof NaN)      // => number
      console.log(typeof Infinity) // => number
    #+end_src
*** 数学运算
    #+begin_src javascript
      // 取余
      console.log(10 % 3)
      // 科学记数法
      console.log(2e3)
      // 幂
      console.log(2 ** 3)
      // 加 减 乘 除
      console.log(5 + 4 - 3 * 2 / 1)
    #+end_src
