JavaScript简明总结.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-11-15 日 16:03 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>JavaScript简明总结</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Evan Meek">
<link rel="shortcut icon" href="/images/rose-red.png" type="image/x-icon" />
<link rel="stylesheet" href="/css/animate.min.css" />
<link rel="stylesheet" href="/css/all.min.css" />
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">JavaScript简明总结</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb535304">前言</a></li>
<li><a href="#orga8e965b">运行</a>
<ul>
<li><a href="#org7e6eaf8">运行方式</a></li>
<li><a href="#org6dd2958">调试</a></li>
<li><a href="#org7e00c10">注释</a></li>
<li><a href="#orgb69347d">分号</a></li>
</ul>
</li>
<li><a href="#org90a712f">数据类型</a>
<ul>
<li><a href="#orge665ba6">数值型</a>
<ul>
<li><a href="#org4062c38">整数</a></li>
<li><a href="#org4b71547">浮点数</a></li>
<li><a href="#org30be482">NaN</a></li>
<li><a href="#orgfb2fc82">Infinity</a></li>
<li><a href="#org3feb423">typeof</a></li>
<li><a href="#orgeb3e859">数学运算</a></li>
<li><a href="#org7d88bb4">类型转换</a></li>
</ul>
</li>
<li><a href="#org1b68f7a">字符串</a>
<ul>
<li><a href="#org3539654">表示方式</a></li>
<li><a href="#org4b2a64f">索引</a></li>
<li><a href="#org9cc4099">不可变性质</a></li>
<li><a href="#org5386fd9">转义字符</a></li>
<li><a href="#org3983e5b">多行字符串</a></li>
<li><a href="#orgc6e6848">字符串拼接</a></li>
<li><a href="#org7df11b4">格式化</a></li>
<li><a href="#org59a0e00">弱类型</a></li>
<li><a href="#org0d805c6">URL编码</a></li>
<li><a href="#org313ec75">常用的字符串方法</a></li>
</ul>
</li>
<li><a href="#orgb25cd7e">数组类型</a>
<ul>
<li><a href="#orgfda3293">操作数组</a></li>
<li><a href="#orgb4bdc39">常用的数组方法</a></li>
</ul>
</li>
<li><a href="#orgda2a8cb">对象类型</a>
<ul>
<li><a href="#org91c917e">Object类型</a></li>
<li><a href="#org077f44d">属性监测</a></li>
<li><a href="#org648860c">对象方法</a></li>
<li><a href="#orgdc2f84b">检测对象是否为空</a></li>
</ul>
</li>
<li><a href="#org004fabf">Map类型</a></li>
<li><a href="#org927bfb3">Set类型</a></li>
<li><a href="#orge916cf3">null类型</a></li>
<li><a href="#org40bf4b7">undefined类型</a></li>
<li><a href="#org34f07e2">类型检测</a>
<ul>
<li><a href="#orgaffe51c">恒等和相等的区别</a></li>
</ul>
</li>
<li><a href="#org7db8590">包装对象</a></li>
</ul>
</li>
<li><a href="#org482fe7f">流程控制</a>
<ul>
<li><a href="#org3ca32b7">逻辑判断</a></li>
<li><a href="#orgbd776be">if 语句</a></li>
<li><a href="#org5a2673b">switch语句</a></li>
</ul>
</li>
<li><a href="#orgd60017d">循环</a>
<ul>
<li><a href="#org846db24">for循环</a></li>
<li><a href="#org19419f5">while循环</a></li>
<li><a href="#org7a5bf8b">continue</a></li>
<li><a href="#orgb3f6b38">break</a></li>
</ul>
</li>
<li><a href="#org810d436">函数</a>
<ul>
<li><a href="#org26e48a4">基本的函数</a>
<ul>
<li><a href="#org35e7c1e">funtion</a></li>
<li><a href="#org2817f67">return</a></li>
<li><a href="#org8a9b7c6">参数</a></li>
<li><a href="#org4c4761c">默认参数</a></li>
<li><a href="#orgfeab8cb">arguments参数对象</a></li>
<li><a href="#orgb4d4180">rest参数打包</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgb535304" class="outline-2">
<h2 id="orgb535304">前言</h2>
<div class="outline-text-2" id="text-orgb535304">
<p>
JavaScript发展至今已经是一门全栈语言了，你可以用它进行桌面应用开发，移动开发，服务端开发，前端开发等。
</p>
</div>
</div>
<div id="outline-container-orga8e965b" class="outline-2">
<h2 id="orga8e965b">运行</h2>
<div class="outline-text-2" id="text-orga8e965b">
</div>
<div id="outline-container-org7e6eaf8" class="outline-3">
<h3 id="org7e6eaf8">运行方式</h3>
<div class="outline-text-3" id="text-org7e6eaf8">
<p>
JavaScript和CSS一样可以有三种被引用的方式，第一种，引用外部js文件。
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #D9DAA2;">script</span> <span style="color: #85DDFF;">src</span>=<span style="color: #DB8E73;">"path_to/file.js"</span> <span style="color: #85DDFF;">type</span>=<span style="color: #DB8E73;">"text/javascript"</span>/&gt;
</pre>
</div>

<p>
第二种，直接将代码放在HTML文件中。
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #D9DAA2;">html</span>&gt;
  &lt;<span style="color: #D9DAA2;">head</span>&gt;
    &lt;<span style="color: #D9DAA2;">script</span> <span style="color: #85DDFF;">type</span>=<span style="color: #DB8E73;">"text/javascript"</span>&gt;
      alert('Hello World')
    &lt;/<span style="color: #D9DAA2;">script</span>&gt;
  &lt;/<span style="color: #D9DAA2;">head</span>&gt;
  &lt;<span style="color: #D9DAA2;">body</span>&gt;
  &lt;/<span style="color: #D9DAA2;">body</span>&gt;
&lt;/<span style="color: #D9DAA2;">html</span>&gt;
</pre>
</div>

<p>
第三种，将代码放在标签的动作属性上。
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #D9DAA2;">html</span>&gt;
  &lt;<span style="color: #D9DAA2;">head</span>&gt;
  &lt;/<span style="color: #D9DAA2;">head</span>&gt;
  &lt;<span style="color: #D9DAA2;">body</span>&gt;
    &lt;<span style="color: #D9DAA2;">em</span> <span style="color: #85DDFF;">onclick</span>=<span style="color: #DB8E73;">"alert('Hello World')"</span>&gt;<span style="font-style: italic;">&#28857;&#25105;</span>&lt;/<span style="color: #D9DAA2;">em</span>&gt;
  &lt;/<span style="color: #D9DAA2;">body</span>&gt;
&lt;/<span style="color: #D9DAA2;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org6dd2958" class="outline-3">
<h3 id="org6dd2958">调试</h3>
<div class="outline-text-3" id="text-org6dd2958">
<p>
调试JS代码通常由浏览器的前端调试工具提供，打开调试工具的快捷键通常是 <code>F12</code> 。
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #D9DAA2;">html</span>&gt;
    &lt;<span style="color: #D9DAA2;">head</span>&gt;
        &lt;<span style="color: #D9DAA2;">script</span> <span style="color: #85DDFF;">type</span>=<span style="color: #DB8E73;">"text/javascript"</span>&gt;
         /* &#36755;&#20986;&#20869;&#23481;&#33267;&#25511;&#21046;&#21488; */
         console.log("Hello World")
        &lt;/<span style="color: #D9DAA2;">script</span>&gt;
    &lt;/<span style="color: #D9DAA2;">head</span>&gt;
    &lt;<span style="color: #D9DAA2;">body</span>&gt;
        &lt;<span style="color: #D9DAA2;">p</span>&gt;&#25171;&#24320;&#36825;&#20010;&#39029;&#38754;&#20250;&#22312;&#25511;&#21046;&#21488;&#36755;&#20986;Hello World&lt;/<span style="color: #D9DAA2;">p</span>&gt;
    &lt;/<span style="color: #D9DAA2;">body</span>&gt;
&lt;/<span style="color: #D9DAA2;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org7e00c10" class="outline-3">
<h3 id="org7e00c10">注释</h3>
<div class="outline-text-3" id="text-org7e00c10">
<p>
JS代码的注释有:
</p>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#21333;&#34892;&#27880;&#37322;</span>
<span style="color: #579C4C;">/*</span>
<span style="color: #579C4C;">  &#22810;&#34892;&#27880;&#37322;</span>
<span style="color: #579C4C;">  &#22810;&#34892;&#27880;&#37322;</span>
<span style="color: #579C4C;"> */</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-orgb69347d" class="outline-3">
<h3 id="orgb69347d">分号</h3>
<div class="outline-text-3" id="text-orgb69347d">
<p>
JS代码结尾可以不加分号，关于是否需要写上可以根据你所在的团队和个人习惯决定。
</p>
</div>
</div>
</div>
<div id="outline-container-org90a712f" class="outline-2">
<h2 id="org90a712f">数据类型</h2>
<div class="outline-text-2" id="text-org90a712f">
<p>
JS具有一些内置的数据类型，分别是如下几种。
</p>
</div>
<div id="outline-container-orge665ba6" class="outline-3">
<h3 id="orge665ba6">数值型</h3>
<div class="outline-text-3" id="text-orge665ba6">
<p>
数值型分为四类- <code>整数</code> ， <code>浮点数</code>  ， <code>NaN</code> 和 <code>Infinity</code> 。
</p>
</div>
<div id="outline-container-org4062c38" class="outline-4">
<h4 id="org4062c38">整数</h4>
<div class="outline-text-4" id="text-org4062c38">
<div class="org-src-container">
<pre class="src src-javascript">console.log<span style="color: #C586C0;">(</span>1<span style="color: #C586C0;">)</span>
console.log<span style="color: #C586C0;">(</span>-1<span style="color: #C586C0;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org4b71547" class="outline-4">
<h4 id="org4b71547">浮点数</h4>
<div class="outline-text-4" id="text-org4b71547">
<div class="org-src-container">
<pre class="src src-javascript">console.log<span style="color: #C586C0;">(</span>1.0<span style="color: #C586C0;">)</span>
console.log<span style="color: #C586C0;">(</span>-1.1111<span style="color: #C586C0;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org30be482" class="outline-4">
<h4 id="org30be482">NaN</h4>
<div class="outline-text-4" id="text-org30be482">
<p>
代表非数字
</p>
<div class="org-src-container">
<pre class="src src-javascript">console.log<span style="color: #C586C0;">(</span>0 / 0<span style="color: #C586C0;">)</span> <span style="color: #579C4C;">// </span><span style="color: #579C4C;">Nan</span>
Number<span style="color: #C586C0;">(</span><span style="color: #DB8E73;">'a'</span><span style="color: #C586C0;">)</span>        <span style="color: #579C4C;">// </span><span style="color: #579C4C;">Nan</span>

<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#21028;&#26029;&#23545;&#35937;&#26159;&#21542;&#26159;NaN</span>
console.log<span style="color: #C586C0;">(</span>isNaN<span style="color: #DB8E73;">(</span><span style="color: #339CDB;">NaN</span><span style="color: #DB8E73;">)</span><span style="color: #C586C0;">)</span>         <span style="color: #579C4C;">// </span><span style="color: #579C4C;">=&gt; true</span>
console.log<span style="color: #C586C0;">(</span>isNaN<span style="color: #DB8E73;">(</span><span style="color: #DB8E73;">'a'</span><span style="color: #DB8E73;">)</span><span style="color: #C586C0;">)</span>         <span style="color: #579C4C;">// </span><span style="color: #579C4C;">=&gt; true</span>
console.log<span style="color: #C586C0;">(</span>isNaN<span style="color: #DB8E73;">(</span>1<span style="color: #DB8E73;">)</span><span style="color: #C586C0;">)</span>           <span style="color: #579C4C;">// </span><span style="color: #579C4C;">false</span>

<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#22353;&#65292;&#24819;&#35201;&#21028;&#26029;&#19968;&#20010;NaN&#23545;&#35937;&#65292;&#20351;&#29992;isNaN</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #339CDB;">NaN</span> != <span style="color: #339CDB;">NaN</span><span style="color: #C586C0;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfb2fc82" class="outline-4">
<h4 id="orgfb2fc82">Infinity</h4>
<div class="outline-text-4" id="text-orgfb2fc82">
<p>
代表无穷大或小的数字
</p>
<div class="org-src-container">
<pre class="src src-javascript">console.log<span style="color: #C586C0;">(</span>1 / 0<span style="color: #C586C0;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org3feb423" class="outline-4">
<h4 id="org3feb423">typeof</h4>
<div class="outline-text-4" id="text-org3feb423">
<p>
检查类型
</p>
<div class="org-src-container">
<pre class="src src-javascript">console.log<span style="color: #C586C0;">(</span><span style="color: #339CDB;">typeof</span> 1<span style="color: #C586C0;">)</span>        <span style="color: #579C4C;">// </span><span style="color: #579C4C;">=&gt; number</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #339CDB;">typeof</span> 1.0<span style="color: #C586C0;">)</span>      <span style="color: #579C4C;">// </span><span style="color: #579C4C;">=&gt; number</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #339CDB;">typeof</span> <span style="color: #339CDB;">NaN</span><span style="color: #C586C0;">)</span>      <span style="color: #579C4C;">// </span><span style="color: #579C4C;">=&gt; number</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #339CDB;">typeof</span> <span style="color: #339CDB;">Infinity</span><span style="color: #C586C0;">)</span> <span style="color: #579C4C;">// </span><span style="color: #579C4C;">=&gt; number</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgeb3e859" class="outline-4">
<h4 id="orgeb3e859">数学运算</h4>
<div class="outline-text-4" id="text-orgeb3e859">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#21462;&#20313;</span>
console.log<span style="color: #C586C0;">(</span>10 % 3<span style="color: #C586C0;">)</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#31185;&#23398;&#35760;&#25968;&#27861;</span>
console.log<span style="color: #C586C0;">(</span>2e3<span style="color: #C586C0;">)</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#24130;</span>
console.log<span style="color: #C586C0;">(</span>2 ** 3<span style="color: #C586C0;">)</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#21152; &#20943; &#20056; &#38500;</span>
console.log<span style="color: #C586C0;">(</span>5 + 4 - 3 * 2 / 1<span style="color: #C586C0;">)</span>
</pre>
</div>
</div>
</div>
