org/JavaScript简明总结.org
*** 类型转换
    #+begin_src javascript
      // string to number
      console.log(Number("1"))
      console.log(Number('1.1'))

      // float to integer
      console.log(parseInt(1.1))
      // integer to float
      console.log(parseFloat(1))
    #+end_src
** 字符串
   字符串 = String
*** 表示方式

    #+begin_src javascript
      console.log(typeof 'single quote string')
      console.log(typeof "double quote string")
    #+end_src

*** 索引
    字符串也是一个 ~序列~ ，所以可以通过序列下标访问。
    #+begin_src javascript
      let s = "AAAB"
      console.log(s[3]) // => B
    #+end_src

*** 不可变性质
    字符串是一种特殊的序列，因为其不可修改。
    #+begin_src javascript
      let s = "AAAB"

      s[3] = "A"

      console.log(s) // => AAAB
    #+end_src

*** 转义字符
    字符串中如果包含了一些特定的字符就会被自动转义成其他内容。
    #+begin_src javascript
      // 转义双引号
      console.log("\'")               // '
      // 转义 双引号
      console.log("\"")               // "
      // 转义ASCII码
      console.log("\x61")             // a
      // 转义Unicode
      console.log("\u00061")          // a
      // 转义 换行符
      console.log("你好\n世界")       // 你好换行世界
      // windows系统转义 换行符
      console.log("你好\r\n世界")     // 你好换行世界
      // 转义 制表符
      console.log("你好\t世界")       // 你好    世界
    #+end_src
*** 多行字符串
    需要表示多行字符串可以将字符串包裹在一个 ~``~ 之间。
    #+begin_src javascript
      var s = `
      多行
      字符串
      OHHHHHHH!!!
              `
      console.log(s)
    #+end_src
*** 字符串拼接
    #+begin_src javascript
      console.log("你好" + "世界")    // 你好世界
    #+end_src
*** 格式化
    格式化字符串，可以将数据跟字符串结合起来。
    #+begin_src javascript
      var s = "Hello World."
      // 早期形式
      console.log("Your first code: " + s + ".")
      // 现代形式 必须用``
      console.log(`Your first code: ${s}.`)
    #+end_src
*** 弱类型
    不同数据类型的数据进行操作可能会被隐式转换成某个组合，不会出错。
    #+begin_src javascript
      // 被转换为字符串
      console.log(1 + '2')            // 12
    #+end_src
*** URL编码
    可以对指定字符串中的特殊字符进行编码翻译。
    #+begin_src javascript
      // 编码
      let evanWebSite = encodeURI("https://evanmeek.github.io/JavaScript简明总结.html")
      console.log(evanWebSite)
      // 解码
      console.log(decodeURI(evanWebSite))
    #+end_src
