JavaScript简明总结.html
<div id="outline-container-org7d88bb4" class="outline-4">
<h4 id="org7d88bb4">类型转换</h4>
<div class="outline-text-4" id="text-org7d88bb4">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #579C4C;">// </span><span style="color: #579C4C;">string to number</span>
console.log<span style="color: #C586C0;">(</span>Number<span style="color: #DB8E73;">(</span><span style="color: #DB8E73;">"1"</span><span style="color: #DB8E73;">)</span><span style="color: #C586C0;">)</span>
console.log<span style="color: #C586C0;">(</span>Number<span style="color: #DB8E73;">(</span><span style="color: #DB8E73;">'1.1'</span><span style="color: #DB8E73;">)</span><span style="color: #C586C0;">)</span>

<span style="color: #579C4C;">// </span><span style="color: #579C4C;">float to integer</span>
console.log<span style="color: #C586C0;">(</span>parseInt<span style="color: #DB8E73;">(</span>1.1<span style="color: #DB8E73;">)</span><span style="color: #C586C0;">)</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">integer to float</span>
console.log<span style="color: #C586C0;">(</span>parseFloat<span style="color: #DB8E73;">(</span>1<span style="color: #DB8E73;">)</span><span style="color: #C586C0;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org1b68f7a" class="outline-3">
<h3 id="org1b68f7a">字符串</h3>
<div class="outline-text-3" id="text-org1b68f7a">
<p>
字符串 = String
</p>
</div>
<div id="outline-container-org3539654" class="outline-4">
<h4 id="org3539654">表示方式</h4>
<div class="outline-text-4" id="text-org3539654">
<div class="org-src-container">
<pre class="src src-javascript">console.log<span style="color: #C586C0;">(</span><span style="color: #339CDB;">typeof</span> <span style="color: #DB8E73;">'single quote string'</span><span style="color: #C586C0;">)</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #339CDB;">typeof</span> <span style="color: #DB8E73;">"double quote string"</span><span style="color: #C586C0;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4b2a64f" class="outline-4">
<h4 id="org4b2a64f">索引</h4>
<div class="outline-text-4" id="text-org4b2a64f">
<p>
字符串也是一个 <code>序列</code> ，所以可以通过序列下标访问。
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #339CDB;">let</span> <span style="color: #85DDFF;">s</span> = <span style="color: #DB8E73;">"AAAB"</span>
console.log<span style="color: #C586C0;">(</span>s<span style="color: #DB8E73;">[</span>3<span style="color: #DB8E73;">]</span><span style="color: #C586C0;">)</span> <span style="color: #579C4C;">// </span><span style="color: #579C4C;">=&gt; B</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9cc4099" class="outline-4">
<h4 id="org9cc4099">不可变性质</h4>
<div class="outline-text-4" id="text-org9cc4099">
<p>
字符串是一种特殊的序列，因为其不可修改。
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #339CDB;">let</span> <span style="color: #85DDFF;">s</span> = <span style="color: #DB8E73;">"AAAB"</span>

s<span style="color: #C586C0;">[</span>3<span style="color: #C586C0;">]</span> = <span style="color: #DB8E73;">"A"</span>

console.log<span style="color: #C586C0;">(</span>s<span style="color: #C586C0;">)</span> <span style="color: #579C4C;">// </span><span style="color: #579C4C;">=&gt; AAAB</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5386fd9" class="outline-4">
<h4 id="org5386fd9">转义字符</h4>
<div class="outline-text-4" id="text-org5386fd9">
<p>
字符串中如果包含了一些特定的字符就会被自动转义成其他内容。
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#36716;&#20041;&#21452;&#24341;&#21495;</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #DB8E73;">"\'"</span><span style="color: #C586C0;">)</span>               <span style="color: #579C4C;">// </span><span style="color: #579C4C;">'</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#36716;&#20041; &#21452;&#24341;&#21495;</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #DB8E73;">"\""</span><span style="color: #C586C0;">)</span>               <span style="color: #579C4C;">// </span><span style="color: #579C4C;">"</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#36716;&#20041;ASCII&#30721;</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #DB8E73;">"\x61"</span><span style="color: #C586C0;">)</span>             <span style="color: #579C4C;">// </span><span style="color: #579C4C;">a</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#36716;&#20041;Unicode</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #DB8E73;">"\u00061"</span><span style="color: #C586C0;">)</span>          <span style="color: #579C4C;">// </span><span style="color: #579C4C;">a</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#36716;&#20041; &#25442;&#34892;&#31526;</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #DB8E73;">"&#20320;&#22909;\n&#19990;&#30028;"</span><span style="color: #C586C0;">)</span>       <span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#20320;&#22909;&#25442;&#34892;&#19990;&#30028;</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">windows&#31995;&#32479;&#36716;&#20041; &#25442;&#34892;&#31526;</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #DB8E73;">"&#20320;&#22909;\r\n&#19990;&#30028;"</span><span style="color: #C586C0;">)</span>     <span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#20320;&#22909;&#25442;&#34892;&#19990;&#30028;</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#36716;&#20041; &#21046;&#34920;&#31526;</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #DB8E73;">"&#20320;&#22909;\t&#19990;&#30028;"</span><span style="color: #C586C0;">)</span>       <span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#20320;&#22909;    &#19990;&#30028;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org3983e5b" class="outline-4">
<h4 id="org3983e5b">多行字符串</h4>
<div class="outline-text-4" id="text-org3983e5b">
<p>
需要表示多行字符串可以将字符串包裹在一个 <code>``</code> 之间。
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #339CDB;">var</span> <span style="color: #85DDFF;">s</span> = <span style="color: #DB8E73;">`</span>
<span style="color: #DB8E73;">&#22810;&#34892;</span>
<span style="color: #DB8E73;">&#23383;&#31526;&#20018;</span>
<span style="color: #DB8E73;">OHHHHHHH!!!</span>
<span style="color: #DB8E73;">        `</span>
console.log<span style="color: #C586C0;">(</span>s<span style="color: #C586C0;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc6e6848" class="outline-4">
<h4 id="orgc6e6848">字符串拼接</h4>
<div class="outline-text-4" id="text-orgc6e6848">
<div class="org-src-container">
<pre class="src src-javascript">console.log<span style="color: #C586C0;">(</span><span style="color: #DB8E73;">"&#20320;&#22909;"</span> + <span style="color: #DB8E73;">"&#19990;&#30028;"</span><span style="color: #C586C0;">)</span>    <span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#20320;&#22909;&#19990;&#30028;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7df11b4" class="outline-4">
<h4 id="org7df11b4">格式化</h4>
<div class="outline-text-4" id="text-org7df11b4">
<p>
格式化字符串，可以将数据跟字符串结合起来。
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #339CDB;">var</span> <span style="color: #85DDFF;">s</span> = <span style="color: #DB8E73;">"Hello World."</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#26089;&#26399;&#24418;&#24335;</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #DB8E73;">"Your first code: "</span> + s + <span style="color: #DB8E73;">"."</span><span style="color: #C586C0;">)</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#29616;&#20195;&#24418;&#24335; &#24517;&#39035;&#29992;``</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #DB8E73;">`Your first code: ${s}.`</span><span style="color: #C586C0;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org59a0e00" class="outline-4">
<h4 id="org59a0e00">弱类型</h4>
<div class="outline-text-4" id="text-org59a0e00">
<p>
不同数据类型的数据进行操作可能会被隐式转换成某个组合，不会出错。
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#34987;&#36716;&#25442;&#20026;&#23383;&#31526;&#20018;</span>
console.log<span style="color: #C586C0;">(</span>1 + <span style="color: #DB8E73;">'2'</span><span style="color: #C586C0;">)</span>            <span style="color: #579C4C;">// </span><span style="color: #579C4C;">12</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org0d805c6" class="outline-4">
<h4 id="org0d805c6">URL编码</h4>
<div class="outline-text-4" id="text-org0d805c6">
<p>
可以对指定字符串中的特殊字符进行编码翻译。
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#32534;&#30721;</span>
<span style="color: #339CDB;">let</span> <span style="color: #85DDFF;">evanWebSite</span> = encodeURI<span style="color: #C586C0;">(</span><span style="color: #DB8E73;">"https://evanmeek.github.io/JavaScript&#31616;&#26126;&#24635;&#32467;.html"</span><span style="color: #C586C0;">)</span>
console.log<span style="color: #C586C0;">(</span>evanWebSite<span style="color: #C586C0;">)</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#35299;&#30721;</span>
console.log<span style="color: #C586C0;">(</span>decodeURI<span style="color: #DB8E73;">(</span>evanWebSite<span style="color: #DB8E73;">)</span><span style="color: #C586C0;">)</span>
</pre>
</div>
</div>
</div>
