org/JavaScript简明总结.org
*** 常用的字符串方法
    #+begin_src javascript
      // 获取字符串长度
      console.log('hello,world.'.length)
      // 转为大写
      console.log('hello,world.'.toUpperCase())
      // 转为小写
      console.log('HELLO,WORLD.'.toLowerCase())
      // 获取字符参数首次出现的索引位置，不存在返回-1。
      console.log("hello,world.".indexOf('o'))
      // 切片获取子串，从0开始，获取2位
      console.log("hello,world.".substr(0,2))
      // 判断结尾字符串
      console.log('myjs.js'.endsWith('.js'))
      // 替换字符
      console.log("AAAAAAB".replace("A","B"))
      // 根据某个字符分割字符串
      console.log("A,B,C".split(","))
    #+end_src
** 数组类型
   数组 = Array
   Array就是可以放一堆数据的集合，这些数据可以是任意类型的。
   #+begin_src javascript
     let arr = [1,2.2,"3",NaN,Infinity,null,true,[],{}]
     // typeof 验证数组其类型为 object，坑之一。
     console.log(typeof arr)
   #+end_src   
*** 操作数组
    #+begin_src javascript
      // 初始化并创建数组
      let arr = [1,2,3]
      // 取数组第一个值
      console.log(arr[0])
      // 为数组最后一个元素重新赋值
      arr[2] = 10
      console.log(arr[2])
    #+end_src
*** 常用的数组方法
    #+begin_src javascript
      // 数组长度
      console.log([].length)
      // 元素首次出现的位置，不存在返回-1
      console.log(['a', 2, 3].indexOf('a'))
      // 切片，从0~2位
      console.log(['a', 'b', 'c'].slice(0, 2))
      // 排序
      console.log([1, 3, 2].sort())
      // 逆序
      console.log([3, 2, 1].reverse())

      // 追加元素
      var arr = [1, 2]
      arr.push(3)
      console.log(arr)

      // 弹出最后元素
      var arr = [1, 2, 3]
      arr.pop()
      console.log(arr)

      // 添加新元素至开头，并返回长度
      var arr = [2, 3]
      console.log(arr.unshift(1))
      console.log(arr)

      // 合并数组
      var arr = [1, 2, 3]
      var arr2 = ['a', 'b', 'c']
      var arr3 = arr.concat(arr2)
      console.log(arr3)

      // 替换
      var arr = [1, 2, 'a', 'a', 'a', 'a', 3]
      console.log(arr.splice(1, 2, 'a'))
      console.log(arr)

      // 删除
      var arr = [1, 2, 3]
      console.log(arr.splice(0, arr.length - 1))
      console.log(arr)
    #+end_src
** 对象类型
*** Object类型
    JS的对象即 无序的 key . value 集合，用 ~{}~ 表示。
    #+begin_src javascript
      var student = {
          name : "EvanMeek",
          age  : 19
      }
      // 访问
      console.log(student.name)
      console.log(student['age'])
      console.log(student)
      // 赋值
      student.age = 20
      console.log(student)
      // 删除
      delete student.age
      console.log(student)
    #+end_src
