JavaScript简明总结.html
<div id="outline-container-org313ec75" class="outline-4">
<h4 id="org313ec75">常用的字符串方法</h4>
<div class="outline-text-4" id="text-org313ec75">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#33719;&#21462;&#23383;&#31526;&#20018;&#38271;&#24230;</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #DB8E73;">'hello,world.'</span>.length<span style="color: #C586C0;">)</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#36716;&#20026;&#22823;&#20889;</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #DB8E73;">'hello,world.'</span>.toUpperCase<span style="color: #DB8E73;">()</span><span style="color: #C586C0;">)</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#36716;&#20026;&#23567;&#20889;</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #DB8E73;">'HELLO,WORLD.'</span>.toLowerCase<span style="color: #DB8E73;">()</span><span style="color: #C586C0;">)</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#33719;&#21462;&#23383;&#31526;&#21442;&#25968;&#39318;&#27425;&#20986;&#29616;&#30340;&#32034;&#24341;&#20301;&#32622;&#65292;&#19981;&#23384;&#22312;&#36820;&#22238;-1&#12290;</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #DB8E73;">"hello,world."</span>.indexOf<span style="color: #DB8E73;">(</span><span style="color: #DB8E73;">'o'</span><span style="color: #DB8E73;">)</span><span style="color: #C586C0;">)</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#20999;&#29255;&#33719;&#21462;&#23376;&#20018;&#65292;&#20174;0&#24320;&#22987;&#65292;&#33719;&#21462;2&#20301;</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #DB8E73;">"hello,world."</span>.substr<span style="color: #DB8E73;">(</span>0,2<span style="color: #DB8E73;">)</span><span style="color: #C586C0;">)</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#21028;&#26029;&#32467;&#23614;&#23383;&#31526;&#20018;</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #DB8E73;">'myjs.js'</span>.endsWith<span style="color: #DB8E73;">(</span><span style="color: #DB8E73;">'.js'</span><span style="color: #DB8E73;">)</span><span style="color: #C586C0;">)</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#26367;&#25442;&#23383;&#31526;</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #DB8E73;">"AAAAAAB"</span>.replace<span style="color: #DB8E73;">(</span><span style="color: #DB8E73;">"A"</span>,<span style="color: #DB8E73;">"B"</span><span style="color: #DB8E73;">)</span><span style="color: #C586C0;">)</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#26681;&#25454;&#26576;&#20010;&#23383;&#31526;&#20998;&#21106;&#23383;&#31526;&#20018;</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #DB8E73;">"A,B,C"</span>.split<span style="color: #DB8E73;">(</span><span style="color: #DB8E73;">","</span><span style="color: #DB8E73;">)</span><span style="color: #C586C0;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb25cd7e" class="outline-3">
<h3 id="orgb25cd7e">数组类型</h3>
<div class="outline-text-3" id="text-orgb25cd7e">
<p>
数组 = Array
Array就是可以放一堆数据的集合，这些数据可以是任意类型的。
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #339CDB;">let</span> <span style="color: #85DDFF;">arr</span> = <span style="color: #C586C0;">[</span>1,2.2,<span style="color: #DB8E73;">"3"</span>,<span style="color: #339CDB;">NaN</span>,<span style="color: #339CDB;">Infinity</span>,<span style="color: #339CDB;">null</span>,<span style="color: #339CDB;">true</span>,<span style="color: #DB8E73;">[]</span>,<span style="color: #DB8E73;">{}</span><span style="color: #C586C0;">]</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">typeof &#39564;&#35777;&#25968;&#32452;&#20854;&#31867;&#22411;&#20026; object&#65292;&#22353;&#20043;&#19968;&#12290;</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #339CDB;">typeof</span> arr<span style="color: #C586C0;">)</span>
</pre>
</div>
</div>
<div id="outline-container-orgfda3293" class="outline-4">
<h4 id="orgfda3293">操作数组</h4>
<div class="outline-text-4" id="text-orgfda3293">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#21021;&#22987;&#21270;&#24182;&#21019;&#24314;&#25968;&#32452;</span>
<span style="color: #339CDB;">let</span> <span style="color: #85DDFF;">arr</span> = <span style="color: #C586C0;">[</span>1,2,3<span style="color: #C586C0;">]</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#21462;&#25968;&#32452;&#31532;&#19968;&#20010;&#20540;</span>
console.log<span style="color: #C586C0;">(</span>arr<span style="color: #DB8E73;">[</span>0<span style="color: #DB8E73;">]</span><span style="color: #C586C0;">)</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#20026;&#25968;&#32452;&#26368;&#21518;&#19968;&#20010;&#20803;&#32032;&#37325;&#26032;&#36171;&#20540;</span>
arr<span style="color: #C586C0;">[</span>2<span style="color: #C586C0;">]</span> = 10
console.log<span style="color: #C586C0;">(</span>arr<span style="color: #DB8E73;">[</span>2<span style="color: #DB8E73;">]</span><span style="color: #C586C0;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb4bdc39" class="outline-4">
<h4 id="orgb4bdc39">常用的数组方法</h4>
<div class="outline-text-4" id="text-orgb4bdc39">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#25968;&#32452;&#38271;&#24230;</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #DB8E73;">[]</span>.length<span style="color: #C586C0;">)</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#20803;&#32032;&#39318;&#27425;&#20986;&#29616;&#30340;&#20301;&#32622;&#65292;&#19981;&#23384;&#22312;&#36820;&#22238;-1</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #DB8E73;">[</span><span style="color: #DB8E73;">'a'</span>, 2, 3<span style="color: #DB8E73;">]</span>.indexOf<span style="color: #DB8E73;">(</span><span style="color: #DB8E73;">'a'</span><span style="color: #DB8E73;">)</span><span style="color: #C586C0;">)</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#20999;&#29255;&#65292;&#20174;0~2&#20301;</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #DB8E73;">[</span><span style="color: #DB8E73;">'a'</span>, <span style="color: #DB8E73;">'b'</span>, <span style="color: #DB8E73;">'c'</span><span style="color: #DB8E73;">]</span>.slice<span style="color: #DB8E73;">(</span>0, 2<span style="color: #DB8E73;">)</span><span style="color: #C586C0;">)</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#25490;&#24207;</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #DB8E73;">[</span>1, 3, 2<span style="color: #DB8E73;">]</span>.sort<span style="color: #DB8E73;">()</span><span style="color: #C586C0;">)</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#36870;&#24207;</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #DB8E73;">[</span>3, 2, 1<span style="color: #DB8E73;">]</span>.reverse<span style="color: #DB8E73;">()</span><span style="color: #C586C0;">)</span>

<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#36861;&#21152;&#20803;&#32032;</span>
<span style="color: #339CDB;">var</span> <span style="color: #85DDFF;">arr</span> = <span style="color: #C586C0;">[</span>1, 2<span style="color: #C586C0;">]</span>
arr.push<span style="color: #C586C0;">(</span>3<span style="color: #C586C0;">)</span>
console.log<span style="color: #C586C0;">(</span>arr<span style="color: #C586C0;">)</span>

<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#24377;&#20986;&#26368;&#21518;&#20803;&#32032;</span>
<span style="color: #339CDB;">var</span> <span style="color: #85DDFF;">arr</span> = <span style="color: #C586C0;">[</span>1, 2, 3<span style="color: #C586C0;">]</span>
arr.pop<span style="color: #C586C0;">()</span>
console.log<span style="color: #C586C0;">(</span>arr<span style="color: #C586C0;">)</span>

<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#28155;&#21152;&#26032;&#20803;&#32032;&#33267;&#24320;&#22836;&#65292;&#24182;&#36820;&#22238;&#38271;&#24230;</span>
<span style="color: #339CDB;">var</span> <span style="color: #85DDFF;">arr</span> = <span style="color: #C586C0;">[</span>2, 3<span style="color: #C586C0;">]</span>
console.log<span style="color: #C586C0;">(</span>arr.unshift<span style="color: #DB8E73;">(</span>1<span style="color: #DB8E73;">)</span><span style="color: #C586C0;">)</span>
console.log<span style="color: #C586C0;">(</span>arr<span style="color: #C586C0;">)</span>

<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#21512;&#24182;&#25968;&#32452;</span>
<span style="color: #339CDB;">var</span> <span style="color: #85DDFF;">arr</span> = <span style="color: #C586C0;">[</span>1, 2, 3<span style="color: #C586C0;">]</span>
<span style="color: #339CDB;">var</span> <span style="color: #85DDFF;">arr2</span> = <span style="color: #C586C0;">[</span><span style="color: #DB8E73;">'a'</span>, <span style="color: #DB8E73;">'b'</span>, <span style="color: #DB8E73;">'c'</span><span style="color: #C586C0;">]</span>
<span style="color: #339CDB;">var</span> <span style="color: #85DDFF;">arr3</span> = arr.concat<span style="color: #C586C0;">(</span>arr2<span style="color: #C586C0;">)</span>
console.log<span style="color: #C586C0;">(</span>arr3<span style="color: #C586C0;">)</span>

<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#26367;&#25442;</span>
<span style="color: #339CDB;">var</span> <span style="color: #85DDFF;">arr</span> = <span style="color: #C586C0;">[</span>1, 2, <span style="color: #DB8E73;">'a'</span>, <span style="color: #DB8E73;">'a'</span>, <span style="color: #DB8E73;">'a'</span>, <span style="color: #DB8E73;">'a'</span>, 3<span style="color: #C586C0;">]</span>
console.log<span style="color: #C586C0;">(</span>arr.splice<span style="color: #DB8E73;">(</span>1, 2, <span style="color: #DB8E73;">'a'</span><span style="color: #DB8E73;">)</span><span style="color: #C586C0;">)</span>
console.log<span style="color: #C586C0;">(</span>arr<span style="color: #C586C0;">)</span>

<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#21024;&#38500;</span>
<span style="color: #339CDB;">var</span> <span style="color: #85DDFF;">arr</span> = <span style="color: #C586C0;">[</span>1, 2, 3<span style="color: #C586C0;">]</span>
console.log<span style="color: #C586C0;">(</span>arr.splice<span style="color: #DB8E73;">(</span>0, arr.length - 1<span style="color: #DB8E73;">)</span><span style="color: #C586C0;">)</span>
console.log<span style="color: #C586C0;">(</span>arr<span style="color: #C586C0;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgda2a8cb" class="outline-3">
<h3 id="orgda2a8cb">对象类型</h3>
<div class="outline-text-3" id="text-orgda2a8cb">
</div>
<div id="outline-container-org91c917e" class="outline-4">
<h4 id="org91c917e">Object类型</h4>
<div class="outline-text-4" id="text-org91c917e">
<p>
JS的对象即 无序的 key . value 集合，用 <code>{}</code> 表示。
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #339CDB;">var</span> <span style="color: #85DDFF;">student</span> = <span style="color: #C586C0;">{</span>
    name : <span style="color: #DB8E73;">"EvanMeek"</span>,
    age  : 19
<span style="color: #C586C0;">}</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#35775;&#38382;</span>
console.log<span style="color: #C586C0;">(</span>student.name<span style="color: #C586C0;">)</span>
console.log<span style="color: #C586C0;">(</span>student<span style="color: #DB8E73;">[</span><span style="color: #DB8E73;">'age'</span><span style="color: #DB8E73;">]</span><span style="color: #C586C0;">)</span>
console.log<span style="color: #C586C0;">(</span>student<span style="color: #C586C0;">)</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#36171;&#20540;</span>
student.age = 20
console.log<span style="color: #C586C0;">(</span>student<span style="color: #C586C0;">)</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#21024;&#38500;</span>
<span style="color: #339CDB;">delete</span> student.age
console.log<span style="color: #C586C0;">(</span>student<span style="color: #C586C0;">)</span>
</pre>
</div>
</div>
</div>
