org/JavaScript简明总结.org
*** 属性监测
    通过 ~in~ 关键词可以检查一个对象是否存在某个属性。
    #+begin_src javascript
      console.log("name" in {name : "EvanMeek"})
    #+end_src
*** 对象方法
    #+begin_src javascript
      // 获取所有属性(key)
      console.log(Object.keys({ a: 1, b: 2 }))
      // 获取所有属性值(value)
      console.log(Object.values({ a: 1, b: 2 }))
      // 合并两个对象
      console.log(Object.assign({ a: 1 }, { b: 2 }))
    #+end_src
*** 检测对象是否为空
    #+begin_src javascript
      console.log({}==={})            // false，类似 NaN !== NaN
      // console.log({}.length)	报错，{}是对象而不是序列，所有没有length属性
      // 通过获取其所有属性的个数判断是否为空
      console.log(Object.keys({}).length)
    #+end_src
** Map类型
   ES6标准的哈系结构，用于补充Object类型。个人感觉很难用!
   补充: Map的key不允许存在相同的
   #+begin_src javascript
     m = new Map([["name", 'EvanMeek'], ["age", 20]])
     console.log(m)
     // 取值
     console.log(m.get(1))
     // 添加key value
     m.set("id", 00001)
     console.log(m)
     // 删除key value
     m.delete("id")
     // 验证是否存在某个key
     console.log(m.has("id"))
     // 获取长度
     console.log(m.size)
     // 获取keys
     console.log(m.keys())
     // 获取values
     console.log(m.values())
   #+end_src
** Set类型
   ~Set~ 用于存储不可变类型，所以其只能存 ~Key~。
   #+begin_src javascript
     s = new Set(["name", 'age'])
     s.add("id")
     console.log(s)
     s.delete("id")
     console.log(s)
     console.log(s.has("id"))
   #+end_src
** null类型
   null = 什么都没有
   #+begin_src javascript
     console.log(null != 0)         // true
     console.log(null != '')        // true
     console.log(null != [])        // true
     console.log(null != {})        // true
     console.log(null != new Map()) // true
     console.log(null != new Set()) // true
     console.log(null === null)     // true
     console.log(typeof null)       // 'object'
   #+end_src
** undefined类型
   undefined = 不存在
   #+begin_src javascript
     console.log(typeof 我不存在)    // 坑，typeof返回的是字符串'undefined'而不是undefined类型
     console.log([][0])              // undefined

     // 未传递参数
     (function (a){
         console.log(a)              // undefined
     })();
     // 函数无返回值
     console.log(function () {} ()); // undefined
   #+end_src
