JavaScript简明总结.html
<div id="outline-container-org077f44d" class="outline-4">
<h4 id="org077f44d">属性监测</h4>
<div class="outline-text-4" id="text-org077f44d">
<p>
通过 <code>in</code> 关键词可以检查一个对象是否存在某个属性。
</p>
<div class="org-src-container">
<pre class="src src-javascript">console.log<span style="color: #C586C0;">(</span><span style="color: #DB8E73;">"name"</span> <span style="color: #339CDB;">in</span> <span style="color: #DB8E73;">{</span>name : <span style="color: #DB8E73;">"EvanMeek"</span><span style="color: #DB8E73;">}</span><span style="color: #C586C0;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org648860c" class="outline-4">
<h4 id="org648860c">对象方法</h4>
<div class="outline-text-4" id="text-org648860c">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#33719;&#21462;&#25152;&#26377;&#23646;&#24615;(key)</span>
console.log<span style="color: #C586C0;">(</span>Object.keys<span style="color: #DB8E73;">(</span><span style="color: #579C4C;">{</span> a: 1, b: 2 <span style="color: #579C4C;">}</span><span style="color: #DB8E73;">)</span><span style="color: #C586C0;">)</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#33719;&#21462;&#25152;&#26377;&#23646;&#24615;&#20540;(value)</span>
console.log<span style="color: #C586C0;">(</span>Object.values<span style="color: #DB8E73;">(</span><span style="color: #579C4C;">{</span> a: 1, b: 2 <span style="color: #579C4C;">}</span><span style="color: #DB8E73;">)</span><span style="color: #C586C0;">)</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#21512;&#24182;&#20004;&#20010;&#23545;&#35937;</span>
console.log<span style="color: #C586C0;">(</span>Object.assign<span style="color: #DB8E73;">(</span><span style="color: #579C4C;">{</span> a: 1 <span style="color: #579C4C;">}</span>, <span style="color: #579C4C;">{</span> b: 2 <span style="color: #579C4C;">}</span><span style="color: #DB8E73;">)</span><span style="color: #C586C0;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdc2f84b" class="outline-4">
<h4 id="orgdc2f84b">检测对象是否为空</h4>
<div class="outline-text-4" id="text-orgdc2f84b">
<div class="org-src-container">
<pre class="src src-javascript">console.log<span style="color: #C586C0;">(</span><span style="color: #DB8E73;">{}</span>===<span style="color: #DB8E73;">{}</span><span style="color: #C586C0;">)</span>            <span style="color: #579C4C;">// </span><span style="color: #579C4C;">false&#65292;&#31867;&#20284; NaN !== NaN</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">console.log({}.length)   &#25253;&#38169;&#65292;{}&#26159;&#23545;&#35937;&#32780;&#19981;&#26159;&#24207;&#21015;&#65292;&#25152;&#26377;&#27809;&#26377;length&#23646;&#24615;</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#36890;&#36807;&#33719;&#21462;&#20854;&#25152;&#26377;&#23646;&#24615;&#30340;&#20010;&#25968;&#21028;&#26029;&#26159;&#21542;&#20026;&#31354;</span>
console.log<span style="color: #C586C0;">(</span>Object.keys<span style="color: #DB8E73;">(</span><span style="color: #579C4C;">{}</span><span style="color: #DB8E73;">)</span>.length<span style="color: #C586C0;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org004fabf" class="outline-3">
<h3 id="org004fabf">Map类型</h3>
<div class="outline-text-3" id="text-org004fabf">
<p>
ES6标准的哈系结构，用于补充Object类型。个人感觉很难用!
补充: Map的key不允许存在相同的
</p>
<div class="org-src-container">
<pre class="src src-javascript">m = <span style="color: #339CDB;">new</span> <span style="color: #35CDAF;">Map</span><span style="color: #C586C0;">(</span><span style="color: #DB8E73;">[</span><span style="color: #579C4C;">[</span><span style="color: #DB8E73;">"name"</span>, <span style="color: #DB8E73;">'EvanMeek'</span><span style="color: #579C4C;">]</span>, <span style="color: #579C4C;">[</span><span style="color: #DB8E73;">"age"</span>, 20<span style="color: #579C4C;">]</span><span style="color: #DB8E73;">]</span><span style="color: #C586C0;">)</span>
console.log<span style="color: #C586C0;">(</span>m<span style="color: #C586C0;">)</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#21462;&#20540;</span>
console.log<span style="color: #C586C0;">(</span>m.get<span style="color: #DB8E73;">(</span>1<span style="color: #DB8E73;">)</span><span style="color: #C586C0;">)</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#28155;&#21152;key value</span>
m.set<span style="color: #C586C0;">(</span><span style="color: #DB8E73;">"id"</span>, 00001<span style="color: #C586C0;">)</span>
console.log<span style="color: #C586C0;">(</span>m<span style="color: #C586C0;">)</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#21024;&#38500;key value</span>
m.<span style="color: #339CDB;">delete</span><span style="color: #C586C0;">(</span><span style="color: #DB8E73;">"id"</span><span style="color: #C586C0;">)</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#39564;&#35777;&#26159;&#21542;&#23384;&#22312;&#26576;&#20010;key</span>
console.log<span style="color: #C586C0;">(</span>m.has<span style="color: #DB8E73;">(</span><span style="color: #DB8E73;">"id"</span><span style="color: #DB8E73;">)</span><span style="color: #C586C0;">)</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#33719;&#21462;&#38271;&#24230;</span>
console.log<span style="color: #C586C0;">(</span>m.size<span style="color: #C586C0;">)</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#33719;&#21462;keys</span>
console.log<span style="color: #C586C0;">(</span>m.keys<span style="color: #DB8E73;">()</span><span style="color: #C586C0;">)</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#33719;&#21462;values</span>
console.log<span style="color: #C586C0;">(</span>m.values<span style="color: #DB8E73;">()</span><span style="color: #C586C0;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org927bfb3" class="outline-3">
<h3 id="org927bfb3">Set类型</h3>
<div class="outline-text-3" id="text-org927bfb3">
<p>
<code>Set</code> 用于存储不可变类型，所以其只能存 ~Key~。
</p>
<div class="org-src-container">
<pre class="src src-javascript">s = <span style="color: #339CDB;">new</span> <span style="color: #35CDAF;">Set</span><span style="color: #C586C0;">(</span><span style="color: #DB8E73;">[</span><span style="color: #DB8E73;">"name"</span>, <span style="color: #DB8E73;">'age'</span><span style="color: #DB8E73;">]</span><span style="color: #C586C0;">)</span>
s.add<span style="color: #C586C0;">(</span><span style="color: #DB8E73;">"id"</span><span style="color: #C586C0;">)</span>
console.log<span style="color: #C586C0;">(</span>s<span style="color: #C586C0;">)</span>
s.<span style="color: #339CDB;">delete</span><span style="color: #C586C0;">(</span><span style="color: #DB8E73;">"id"</span><span style="color: #C586C0;">)</span>
console.log<span style="color: #C586C0;">(</span>s<span style="color: #C586C0;">)</span>
console.log<span style="color: #C586C0;">(</span>s.has<span style="color: #DB8E73;">(</span><span style="color: #DB8E73;">"id"</span><span style="color: #DB8E73;">)</span><span style="color: #C586C0;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge916cf3" class="outline-3">
<h3 id="orge916cf3">null类型</h3>
<div class="outline-text-3" id="text-orge916cf3">
<p>
null = 什么都没有
</p>
<div class="org-src-container">
<pre class="src src-javascript">console.log<span style="color: #C586C0;">(</span><span style="color: #339CDB;">null</span> != 0<span style="color: #C586C0;">)</span>         <span style="color: #579C4C;">// </span><span style="color: #579C4C;">true</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #339CDB;">null</span> != <span style="color: #DB8E73;">''</span><span style="color: #C586C0;">)</span>        <span style="color: #579C4C;">// </span><span style="color: #579C4C;">true</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #339CDB;">null</span> != <span style="color: #DB8E73;">[]</span><span style="color: #C586C0;">)</span>        <span style="color: #579C4C;">// </span><span style="color: #579C4C;">true</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #339CDB;">null</span> != <span style="color: #DB8E73;">{}</span><span style="color: #C586C0;">)</span>        <span style="color: #579C4C;">// </span><span style="color: #579C4C;">true</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #339CDB;">null</span> != <span style="color: #339CDB;">new</span> <span style="color: #35CDAF;">Map</span><span style="color: #DB8E73;">()</span><span style="color: #C586C0;">)</span> <span style="color: #579C4C;">// </span><span style="color: #579C4C;">true</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #339CDB;">null</span> != <span style="color: #339CDB;">new</span> <span style="color: #35CDAF;">Set</span><span style="color: #DB8E73;">()</span><span style="color: #C586C0;">)</span> <span style="color: #579C4C;">// </span><span style="color: #579C4C;">true</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #339CDB;">null</span> === <span style="color: #339CDB;">null</span><span style="color: #C586C0;">)</span>     <span style="color: #579C4C;">// </span><span style="color: #579C4C;">true</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #339CDB;">typeof</span> <span style="color: #339CDB;">null</span><span style="color: #C586C0;">)</span>       <span style="color: #579C4C;">// </span><span style="color: #579C4C;">'object'</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org40bf4b7" class="outline-3">
<h3 id="org40bf4b7">undefined类型</h3>
<div class="outline-text-3" id="text-org40bf4b7">
<p>
undefined = 不存在
</p>
<div class="org-src-container">
<pre class="src src-javascript">console.log<span style="color: #C586C0;">(</span><span style="color: #339CDB;">typeof</span> &#25105;&#19981;&#23384;&#22312;<span style="color: #C586C0;">)</span>    <span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#22353;&#65292;typeof&#36820;&#22238;&#30340;&#26159;&#23383;&#31526;&#20018;'undefined'&#32780;&#19981;&#26159;undefined&#31867;&#22411;</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #DB8E73;">[][</span>0<span style="color: #DB8E73;">]</span><span style="color: #C586C0;">)</span>              <span style="color: #579C4C;">// </span><span style="color: #579C4C;">undefined</span>

<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#26410;&#20256;&#36882;&#21442;&#25968;</span>
<span style="color: #C586C0;">(</span><span style="color: #339CDB;">function</span> <span style="color: #DB8E73;">(</span><span style="color: #85DDFF;">a</span><span style="color: #DB8E73;">){</span>
    console.log<span style="color: #579C4C;">(</span>a<span style="color: #579C4C;">)</span>              <span style="color: #579C4C;">// </span><span style="color: #579C4C;">undefined</span>
<span style="color: #DB8E73;">}</span><span style="color: #C586C0;">)()</span>;
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#20989;&#25968;&#26080;&#36820;&#22238;&#20540;</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #339CDB;">function</span> <span style="color: #DB8E73;">()</span> <span style="color: #DB8E73;">{}</span> <span style="color: #DB8E73;">()</span><span style="color: #C586C0;">)</span>; <span style="color: #579C4C;">// </span><span style="color: #579C4C;">undefined</span>
</pre>
</div>
</div>
</div>
