org/JavaScript简明总结.org
** 类型检测
   ~typeof~ 返回的都是字符串
   #+begin_src javascript
     console.log(typeof 123)               // number
     console.log(typeof 'abc')             // string
     console.log(typeof undefined)         // undefined
     console.log(typeof true)              // boolean
     console.log(typeof Math.abs)          // function
     console.log( null === null)           // true
     console.log([] instanceof Array)      // true
     console.log({} instanceof Object)     // true
     console.log(new Map instanceof Map)   // true
     console.log(new Map() instanceof Map) // true
     console.log(new Set instanceof Set)   // true
     console.log(new Set() instanceof Set) // true
   #+end_src
*** 恒等和相等的区别
    #+begin_src javascript
      console.log('1' == 1)           // 值相等 = true
      console.log('1' === 1)          // 值相等+类型相等 = true
      // JS就nm离谱，由于他们都是object，所以最好还是用恒等吧..
      console.log(undefined == null == '' == 0 == [] == {} == false) // true
    #+end_src
** 包装对象
   JS的坑...之一
   #+begin_src javascript
     var num = 123
     var num = Number(123)
     // 包装对象  傻逼玩意，尽量别用
     var num = new Number(123)
     // 以上num的值应该都是123，但是得到的却是false
     console.log(123 == Number(123) == new Number(123)) // false
   #+end_src
* 流程控制
  即管理代码逻辑的语句
** 逻辑判断
   直接看代码吧，也不难
   #+begin_src javascript
     console.log(1 === 1)          // true  恒等
     console.log(1 !== 1)          // false 非等
     console.log(1 < 1)            // false 小于
     console.log(1 > 1)            // false 大于
     console.log(1 <= 1)           // true 小于或等于
     console.log(1 >= 1)           // true 大于或等于
     console.log(1 == 1 && 1 == 2) // 与运算，两边条件都得为true，整个表达式才为true。
     console.log(1 == 1 || 1 == 2) // 或运算，其中一个条件表达式为true，则整个表达式都为true。
   #+end_src
** if 语句
   if语句有几种变体:
   #+begin_src javascript
     // 普通型
     if (true) {
         // true执行体
     }
     // 如果否则型
     if (true) {
         // true执行体
     } else {
         // false执行体
     }
     // 如果再如果...否则型
     if (false) {
         // true执行体
     } else if (true) {
         // true执行体
     } else {
         // false 执行体
     }
   #+end_src
