JavaScript简明总结.html
<div id="outline-container-org34f07e2" class="outline-3">
<h3 id="org34f07e2">类型检测</h3>
<div class="outline-text-3" id="text-org34f07e2">
<p>
<code>typeof</code> 返回的都是字符串
</p>
<div class="org-src-container">
<pre class="src src-javascript">console.log<span style="color: #C586C0;">(</span><span style="color: #339CDB;">typeof</span> 123<span style="color: #C586C0;">)</span>               <span style="color: #579C4C;">// </span><span style="color: #579C4C;">number</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #339CDB;">typeof</span> <span style="color: #DB8E73;">'abc'</span><span style="color: #C586C0;">)</span>             <span style="color: #579C4C;">// </span><span style="color: #579C4C;">string</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #339CDB;">typeof</span> <span style="color: #339CDB;">undefined</span><span style="color: #C586C0;">)</span>         <span style="color: #579C4C;">// </span><span style="color: #579C4C;">undefined</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #339CDB;">typeof</span> <span style="color: #339CDB;">true</span><span style="color: #C586C0;">)</span>              <span style="color: #579C4C;">// </span><span style="color: #579C4C;">boolean</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #339CDB;">typeof</span> Math.abs<span style="color: #C586C0;">)</span>          <span style="color: #579C4C;">// </span><span style="color: #579C4C;">function</span>
console.log<span style="color: #C586C0;">(</span> <span style="color: #339CDB;">null</span> === <span style="color: #339CDB;">null</span><span style="color: #C586C0;">)</span>           <span style="color: #579C4C;">// </span><span style="color: #579C4C;">true</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #DB8E73;">[]</span> <span style="color: #339CDB;">instanceof</span> <span style="color: #35CDAF;">Array</span><span style="color: #C586C0;">)</span>      <span style="color: #579C4C;">// </span><span style="color: #579C4C;">true</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #DB8E73;">{}</span> <span style="color: #339CDB;">instanceof</span> <span style="color: #35CDAF;">Object</span><span style="color: #C586C0;">)</span>     <span style="color: #579C4C;">// </span><span style="color: #579C4C;">true</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #339CDB;">new</span> <span style="color: #35CDAF;">Map</span> <span style="color: #339CDB;">instanceof</span> <span style="color: #35CDAF;">Map</span><span style="color: #C586C0;">)</span>   <span style="color: #579C4C;">// </span><span style="color: #579C4C;">true</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #339CDB;">new</span> <span style="color: #35CDAF;">Map</span><span style="color: #DB8E73;">()</span> <span style="color: #339CDB;">instanceof</span> <span style="color: #35CDAF;">Map</span><span style="color: #C586C0;">)</span> <span style="color: #579C4C;">// </span><span style="color: #579C4C;">true</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #339CDB;">new</span> <span style="color: #35CDAF;">Set</span> <span style="color: #339CDB;">instanceof</span> <span style="color: #35CDAF;">Set</span><span style="color: #C586C0;">)</span>   <span style="color: #579C4C;">// </span><span style="color: #579C4C;">true</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #339CDB;">new</span> <span style="color: #35CDAF;">Set</span><span style="color: #DB8E73;">()</span> <span style="color: #339CDB;">instanceof</span> <span style="color: #35CDAF;">Set</span><span style="color: #C586C0;">)</span> <span style="color: #579C4C;">// </span><span style="color: #579C4C;">true</span>
</pre>
</div>
</div>
<div id="outline-container-orgaffe51c" class="outline-4">
<h4 id="orgaffe51c">恒等和相等的区别</h4>
<div class="outline-text-4" id="text-orgaffe51c">
<div class="org-src-container">
<pre class="src src-javascript">console.log<span style="color: #C586C0;">(</span><span style="color: #DB8E73;">'1'</span> == 1<span style="color: #C586C0;">)</span>           <span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#20540;&#30456;&#31561; = true</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #DB8E73;">'1'</span> === 1<span style="color: #C586C0;">)</span>          <span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#20540;&#30456;&#31561;+&#31867;&#22411;&#30456;&#31561; = true</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">JS&#23601;nm&#31163;&#35889;&#65292;&#30001;&#20110;&#20182;&#20204;&#37117;&#26159;object&#65292;&#25152;&#20197;&#26368;&#22909;&#36824;&#26159;&#29992;&#24658;&#31561;&#21543;..</span>
console.log<span style="color: #C586C0;">(</span><span style="color: #339CDB;">undefined</span> == <span style="color: #339CDB;">null</span> == <span style="color: #DB8E73;">''</span> == 0 == <span style="color: #DB8E73;">[]</span> == <span style="color: #DB8E73;">{}</span> == <span style="color: #339CDB;">false</span><span style="color: #C586C0;">)</span> <span style="color: #579C4C;">// </span><span style="color: #579C4C;">true</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org7db8590" class="outline-3">
<h3 id="org7db8590">包装对象</h3>
<div class="outline-text-3" id="text-org7db8590">
<p>
JS的坑&#x2026;之一
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #339CDB;">var</span> <span style="color: #85DDFF;">num</span> = 123
<span style="color: #339CDB;">var</span> <span style="color: #85DDFF;">num</span> = Number<span style="color: #C586C0;">(</span>123<span style="color: #C586C0;">)</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#21253;&#35013;&#23545;&#35937;  &#20667;&#36924;&#29609;&#24847;&#65292;&#23613;&#37327;&#21035;&#29992;</span>
<span style="color: #339CDB;">var</span> <span style="color: #85DDFF;">num</span> = <span style="color: #339CDB;">new</span> <span style="color: #35CDAF;">Number</span><span style="color: #C586C0;">(</span>123<span style="color: #C586C0;">)</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#20197;&#19978;num&#30340;&#20540;&#24212;&#35813;&#37117;&#26159;123&#65292;&#20294;&#26159;&#24471;&#21040;&#30340;&#21364;&#26159;false</span>
console.log<span style="color: #C586C0;">(</span>123 == Number<span style="color: #DB8E73;">(</span>123<span style="color: #DB8E73;">)</span> == <span style="color: #339CDB;">new</span> <span style="color: #35CDAF;">Number</span><span style="color: #DB8E73;">(</span>123<span style="color: #DB8E73;">)</span><span style="color: #C586C0;">)</span> <span style="color: #579C4C;">// </span><span style="color: #579C4C;">false</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org482fe7f" class="outline-2">
<h2 id="org482fe7f">流程控制</h2>
<div class="outline-text-2" id="text-org482fe7f">
<p>
即管理代码逻辑的语句
</p>
</div>
<div id="outline-container-org3ca32b7" class="outline-3">
<h3 id="org3ca32b7">逻辑判断</h3>
<div class="outline-text-3" id="text-org3ca32b7">
<p>
直接看代码吧，也不难
</p>
<div class="org-src-container">
<pre class="src src-javascript">console.log<span style="color: #C586C0;">(</span>1 === 1<span style="color: #C586C0;">)</span>          <span style="color: #579C4C;">// </span><span style="color: #579C4C;">true  &#24658;&#31561;</span>
console.log<span style="color: #C586C0;">(</span>1 !== 1<span style="color: #C586C0;">)</span>          <span style="color: #579C4C;">// </span><span style="color: #579C4C;">false &#38750;&#31561;</span>
console.log<span style="color: #C586C0;">(</span>1 &lt; 1<span style="color: #C586C0;">)</span>            <span style="color: #579C4C;">// </span><span style="color: #579C4C;">false &#23567;&#20110;</span>
console.log<span style="color: #C586C0;">(</span>1 &gt; 1<span style="color: #C586C0;">)</span>            <span style="color: #579C4C;">// </span><span style="color: #579C4C;">false &#22823;&#20110;</span>
console.log<span style="color: #C586C0;">(</span>1 &lt;= 1<span style="color: #C586C0;">)</span>           <span style="color: #579C4C;">// </span><span style="color: #579C4C;">true &#23567;&#20110;&#25110;&#31561;&#20110;</span>
console.log<span style="color: #C586C0;">(</span>1 &gt;= 1<span style="color: #C586C0;">)</span>           <span style="color: #579C4C;">// </span><span style="color: #579C4C;">true &#22823;&#20110;&#25110;&#31561;&#20110;</span>
console.log<span style="color: #C586C0;">(</span>1 == 1 &amp;&amp; 1 == 2<span style="color: #C586C0;">)</span> <span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#19982;&#36816;&#31639;&#65292;&#20004;&#36793;&#26465;&#20214;&#37117;&#24471;&#20026;true&#65292;&#25972;&#20010;&#34920;&#36798;&#24335;&#25165;&#20026;true&#12290;</span>
console.log<span style="color: #C586C0;">(</span>1 == 1 || 1 == 2<span style="color: #C586C0;">)</span> <span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#25110;&#36816;&#31639;&#65292;&#20854;&#20013;&#19968;&#20010;&#26465;&#20214;&#34920;&#36798;&#24335;&#20026;true&#65292;&#21017;&#25972;&#20010;&#34920;&#36798;&#24335;&#37117;&#20026;true&#12290;</span>
</pre>
</div>
</div>
</div>
