org/JavaScript简明总结.org
** switch语句
   类似if的语句，你可以理解成语法糖
   #+begin_src javascript
     // 简化if代码而已，但是也不是全能的！
     let n = 1
     switch (n) {
         case 1:
             console.log("当n=1时执行我")
             // break如果不加会把case2也执行了，直到遇到break
             break
         case 2:
             console.log("当n=2时执行我")
             break
         default:
             console.log("当n!=2&&n!=1时执行我")
             break
     }
   #+end_src
* 循环
  循环用于让代码重复执行。
** for循环
   特点是计数方便
   #+begin_src javascript
     // 这个例子会从0开始输出，一直输出到4.
     /*
       所有参数都可忽略，但是不可忽略分号
       for (初始化变量;执行条件;每次执行的操作){
       }
      ,*/
     for (var i = 0; i < 5; i++) {
         console.log(i)
     }
   #+end_src
** while循环
   特点是使用简单:
   #+begin_src javascript
     var i = 0
     // 这个循环会重复执行5次，从0输出到4.
     while (i < 5) {
         console.log(i)
         i++
     }
     /*
       while(条件){
         执行体
       }
      ,*/
   #+end_src
** continue
   跳过本次循环
   #+begin_src javascript
     var i = 0
     // 这个循环会重复执行5次，从0输出到4(除了2).
     while (i < 5) {

         if(i == 2){
             i++
             // 当i == 2时跳过本次循环，后面的代码不会被执行
             continue
         }
         console.log(i)
         i++
     }
     /*
       while(条件){
         执行体
       }
      ,*/
   #+end_src
** break
   退出整个循环
   #+begin_src javascript
     var i = 0
     // 这个循环会执行1次，输出0
     while (i < 5) {

         if(i == 1){
             i++
             // 当i==1时直接杀死整个循环，不会再重复了。
             break
         }
         console.log(i)
         i++
     }
     /*
       while(条件){
         执行体
       }
      ,*/
   #+end_src
* 函数
可以利用函数将一段代码复用
** 基本的函数
   基本的函数写法
*** funtion
    #+begin_src javascript
      function hello(){
          console.log("I say hello.")
      }

      /*
        function 函数名(参量列表){
          函数体
        }
      ,*/
      // 执行函数
      hello()
    #+end_src
*** return
    #+begin_src javascript
      // 返回num1 + num2的和
      function plus(num1, num2) {
          return num1 + num2
      }

      console.log(plus(1, 2))          // 3
    #+end_src
