JavaScript简明总结.html
<div id="outline-container-orgbd776be" class="outline-3">
<h3 id="orgbd776be">if 语句</h3>
<div class="outline-text-3" id="text-orgbd776be">
<p>
if语句有几种变体:
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#26222;&#36890;&#22411;</span>
<span style="color: #339CDB;">if</span> <span style="color: #C586C0;">(</span><span style="color: #339CDB;">true</span><span style="color: #C586C0;">)</span> <span style="color: #C586C0;">{</span>
    <span style="color: #579C4C;">// </span><span style="color: #579C4C;">true&#25191;&#34892;&#20307;</span>
<span style="color: #C586C0;">}</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#22914;&#26524;&#21542;&#21017;&#22411;</span>
<span style="color: #339CDB;">if</span> <span style="color: #C586C0;">(</span><span style="color: #339CDB;">true</span><span style="color: #C586C0;">)</span> <span style="color: #C586C0;">{</span>
    <span style="color: #579C4C;">// </span><span style="color: #579C4C;">true&#25191;&#34892;&#20307;</span>
<span style="color: #C586C0;">}</span> <span style="color: #339CDB;">else</span> <span style="color: #C586C0;">{</span>
    <span style="color: #579C4C;">// </span><span style="color: #579C4C;">false&#25191;&#34892;&#20307;</span>
<span style="color: #C586C0;">}</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#22914;&#26524;&#20877;&#22914;&#26524;...&#21542;&#21017;&#22411;</span>
<span style="color: #339CDB;">if</span> <span style="color: #C586C0;">(</span><span style="color: #339CDB;">false</span><span style="color: #C586C0;">)</span> <span style="color: #C586C0;">{</span>
    <span style="color: #579C4C;">// </span><span style="color: #579C4C;">true&#25191;&#34892;&#20307;</span>
<span style="color: #C586C0;">}</span> <span style="color: #339CDB;">else</span> <span style="color: #339CDB;">if</span> <span style="color: #C586C0;">(</span><span style="color: #339CDB;">true</span><span style="color: #C586C0;">)</span> <span style="color: #C586C0;">{</span>
    <span style="color: #579C4C;">// </span><span style="color: #579C4C;">true&#25191;&#34892;&#20307;</span>
<span style="color: #C586C0;">}</span> <span style="color: #339CDB;">else</span> <span style="color: #C586C0;">{</span>
    <span style="color: #579C4C;">// </span><span style="color: #579C4C;">false &#25191;&#34892;&#20307;</span>
<span style="color: #C586C0;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org5a2673b" class="outline-3">
<h3 id="org5a2673b">switch语句</h3>
<div class="outline-text-3" id="text-org5a2673b">
<p>
类似if的语句，你可以理解成语法糖
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#31616;&#21270;if&#20195;&#30721;&#32780;&#24050;&#65292;&#20294;&#26159;&#20063;&#19981;&#26159;&#20840;&#33021;&#30340;&#65281;</span>
<span style="color: #339CDB;">let</span> <span style="color: #85DDFF;">n</span> = 1
<span style="color: #339CDB;">switch</span> <span style="color: #C586C0;">(</span>n<span style="color: #C586C0;">)</span> <span style="color: #C586C0;">{</span>
    <span style="color: #339CDB;">case</span> 1:
        console.log<span style="color: #DB8E73;">(</span><span style="color: #DB8E73;">"&#24403;n=1&#26102;&#25191;&#34892;&#25105;"</span><span style="color: #DB8E73;">)</span>
        <span style="color: #579C4C;">// </span><span style="color: #579C4C;">break&#22914;&#26524;&#19981;&#21152;&#20250;&#25226;case2&#20063;&#25191;&#34892;&#20102;&#65292;&#30452;&#21040;&#36935;&#21040;break</span>
        <span style="color: #339CDB;">break</span>
    <span style="color: #339CDB;">case</span> 2:
        console.log<span style="color: #DB8E73;">(</span><span style="color: #DB8E73;">"&#24403;n=2&#26102;&#25191;&#34892;&#25105;"</span><span style="color: #DB8E73;">)</span>
        <span style="color: #339CDB;">break</span>
    <span style="color: #339CDB;">default</span>:
        console.log<span style="color: #DB8E73;">(</span><span style="color: #DB8E73;">"&#24403;n!=2&amp;&amp;n!=1&#26102;&#25191;&#34892;&#25105;"</span><span style="color: #DB8E73;">)</span>
        <span style="color: #339CDB;">break</span>
<span style="color: #C586C0;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd60017d" class="outline-2">
<h2 id="orgd60017d">循环</h2>
<div class="outline-text-2" id="text-orgd60017d">
<p>
循环用于让代码重复执行。
</p>
</div>
<div id="outline-container-org846db24" class="outline-3">
<h3 id="org846db24">for循环</h3>
<div class="outline-text-3" id="text-org846db24">
<p>
特点是计数方便
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#36825;&#20010;&#20363;&#23376;&#20250;&#20174;0&#24320;&#22987;&#36755;&#20986;&#65292;&#19968;&#30452;&#36755;&#20986;&#21040;4.</span>
<span style="color: #579C4C;">/*</span>
<span style="color: #579C4C;">  &#25152;&#26377;&#21442;&#25968;&#37117;&#21487;&#24573;&#30053;&#65292;&#20294;&#26159;&#19981;&#21487;&#24573;&#30053;&#20998;&#21495;</span>
<span style="color: #579C4C;">  for (&#21021;&#22987;&#21270;&#21464;&#37327;;&#25191;&#34892;&#26465;&#20214;;&#27599;&#27425;&#25191;&#34892;&#30340;&#25805;&#20316;){</span>
<span style="color: #579C4C;">  }</span>
<span style="color: #579C4C;"> */</span>
<span style="color: #339CDB;">for</span> <span style="color: #C586C0;">(</span><span style="color: #339CDB;">var</span> <span style="color: #85DDFF;">i</span> = 0; i &lt; 5; i++<span style="color: #C586C0;">)</span> <span style="color: #C586C0;">{</span>
    console.log<span style="color: #DB8E73;">(</span>i<span style="color: #DB8E73;">)</span>
<span style="color: #C586C0;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org19419f5" class="outline-3">
<h3 id="org19419f5">while循环</h3>
<div class="outline-text-3" id="text-org19419f5">
<p>
特点是使用简单:
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #339CDB;">var</span> <span style="color: #85DDFF;">i</span> = 0
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#36825;&#20010;&#24490;&#29615;&#20250;&#37325;&#22797;&#25191;&#34892;5&#27425;&#65292;&#20174;0&#36755;&#20986;&#21040;4.</span>
<span style="color: #339CDB;">while</span> <span style="color: #C586C0;">(</span>i &lt; 5<span style="color: #C586C0;">)</span> <span style="color: #C586C0;">{</span>
    console.log<span style="color: #DB8E73;">(</span>i<span style="color: #DB8E73;">)</span>
    i++
<span style="color: #C586C0;">}</span>
<span style="color: #579C4C;">/*</span>
<span style="color: #579C4C;">  while(&#26465;&#20214;){</span>
<span style="color: #579C4C;">    &#25191;&#34892;&#20307;</span>
<span style="color: #579C4C;">  }</span>
<span style="color: #579C4C;"> */</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7a5bf8b" class="outline-3">
<h3 id="org7a5bf8b">continue</h3>
<div class="outline-text-3" id="text-org7a5bf8b">
<p>
跳过本次循环
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #339CDB;">var</span> <span style="color: #85DDFF;">i</span> = 0
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#36825;&#20010;&#24490;&#29615;&#20250;&#37325;&#22797;&#25191;&#34892;5&#27425;&#65292;&#20174;0&#36755;&#20986;&#21040;4(&#38500;&#20102;2).</span>
<span style="color: #339CDB;">while</span> <span style="color: #C586C0;">(</span>i &lt; 5<span style="color: #C586C0;">)</span> <span style="color: #C586C0;">{</span>

    <span style="color: #339CDB;">if</span><span style="color: #DB8E73;">(</span>i == 2<span style="color: #DB8E73;">){</span>
        i++
        <span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#24403;i == 2&#26102;&#36339;&#36807;&#26412;&#27425;&#24490;&#29615;&#65292;&#21518;&#38754;&#30340;&#20195;&#30721;&#19981;&#20250;&#34987;&#25191;&#34892;</span>
        <span style="color: #339CDB;">continue</span>
    <span style="color: #DB8E73;">}</span>
    console.log<span style="color: #DB8E73;">(</span>i<span style="color: #DB8E73;">)</span>
    i++
<span style="color: #C586C0;">}</span>
<span style="color: #579C4C;">/*</span>
<span style="color: #579C4C;">  while(&#26465;&#20214;){</span>
<span style="color: #579C4C;">    &#25191;&#34892;&#20307;</span>
<span style="color: #579C4C;">  }</span>
<span style="color: #579C4C;"> */</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb3f6b38" class="outline-3">
<h3 id="orgb3f6b38">break</h3>
<div class="outline-text-3" id="text-orgb3f6b38">
<p>
退出整个循环
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #339CDB;">var</span> <span style="color: #85DDFF;">i</span> = 0
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#36825;&#20010;&#24490;&#29615;&#20250;&#25191;&#34892;1&#27425;&#65292;&#36755;&#20986;0</span>
<span style="color: #339CDB;">while</span> <span style="color: #C586C0;">(</span>i &lt; 5<span style="color: #C586C0;">)</span> <span style="color: #C586C0;">{</span>

    <span style="color: #339CDB;">if</span><span style="color: #DB8E73;">(</span>i == 1<span style="color: #DB8E73;">){</span>
        i++
        <span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#24403;i==1&#26102;&#30452;&#25509;&#26432;&#27515;&#25972;&#20010;&#24490;&#29615;&#65292;&#19981;&#20250;&#20877;&#37325;&#22797;&#20102;&#12290;</span>
        <span style="color: #339CDB;">break</span>
    <span style="color: #DB8E73;">}</span>
    console.log<span style="color: #DB8E73;">(</span>i<span style="color: #DB8E73;">)</span>
    i++
<span style="color: #C586C0;">}</span>
<span style="color: #579C4C;">/*</span>
<span style="color: #579C4C;">  while(&#26465;&#20214;){</span>
<span style="color: #579C4C;">    &#25191;&#34892;&#20307;</span>
<span style="color: #579C4C;">  }</span>
<span style="color: #579C4C;"> */</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org810d436" class="outline-2">
<h2 id="org810d436">函数</h2>
<div class="outline-text-2" id="text-org810d436">
<p>
可以利用函数将一段代码复用
</p>
</div>
<div id="outline-container-org26e48a4" class="outline-3">
<h3 id="org26e48a4">基本的函数</h3>
<div class="outline-text-3" id="text-org26e48a4">
<p>
基本的函数写法
</p>
</div>
<div id="outline-container-org35e7c1e" class="outline-4">
<h4 id="org35e7c1e">funtion</h4>
<div class="outline-text-4" id="text-org35e7c1e">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #339CDB;">function</span> <span style="color: #D9DAA2;">hello</span><span style="color: #C586C0;">(){</span>
    console.log<span style="color: #DB8E73;">(</span><span style="color: #DB8E73;">"I say hello."</span><span style="color: #DB8E73;">)</span>
<span style="color: #C586C0;">}</span>

<span style="color: #579C4C;">/*</span>
<span style="color: #579C4C;">  function &#20989;&#25968;&#21517;(&#21442;&#37327;&#21015;&#34920;){</span>
<span style="color: #579C4C;">    &#20989;&#25968;&#20307;</span>
<span style="color: #579C4C;">  }</span>
<span style="color: #579C4C;">*/</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#25191;&#34892;&#20989;&#25968;</span>
hello<span style="color: #C586C0;">()</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2817f67" class="outline-4">
<h4 id="org2817f67">return</h4>
<div class="outline-text-4" id="text-org2817f67">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #579C4C;">// </span><span style="color: #579C4C;">&#36820;&#22238;num1 + num2&#30340;&#21644;</span>
<span style="color: #339CDB;">function</span> <span style="color: #D9DAA2;">plus</span><span style="color: #C586C0;">(</span><span style="color: #85DDFF;">num1</span>, <span style="color: #85DDFF;">num2</span><span style="color: #C586C0;">)</span> <span style="color: #C586C0;">{</span>
    <span style="color: #339CDB;">return</span> num1 + num2
<span style="color: #C586C0;">}</span>

console.log<span style="color: #C586C0;">(</span>plus<span style="color: #DB8E73;">(</span>1, 2<span style="color: #DB8E73;">)</span><span style="color: #C586C0;">)</span>          <span style="color: #579C4C;">// </span><span style="color: #579C4C;">3</span>
</pre>
</div>
</div>
</div>
